[
    {
        "id": 1,
        "name": "Iron Man",
        "link": "/assets/ironman1.svg",
        "title": "Iron Man Poster",
        "yt": "https://www.youtube-nocookie.com/embed/8ugaeA-nMTc?si=P43dwbPcZOyJPWYz",
        "description": "Billionaire industrialist and genius inventor Tony Stark is captured by a terrorist group while demonstrating a new weapon. Using his intellect and resourcefulness, he constructs a high-tech suit of armor to escape captivity. Upon returning home, Stark refines his suit and adopts the persona of Iron Man, using his new abilities to combat threats and protect the world.",
        "phase": 1
    }, 
    {
        "id": 2,
        "name": "Hulk",
        "link": "/assets/hulk.svg",
        "title": "Hulk Poster",
        "yt": "https://www.youtube-nocookie.com/embed/xbqNb2PFKKA?si=P57xghWzYHFW25Ny",
        "description": "Scientist Bruce Banner is on the run, seeking a cure for the gamma radiation accident that transforms him into a massive green monster whenever he loses his temper. As he searches for a solution, he must evade capture by the military and confront a new, formidable adversary.",
        "phase": 1
    }, 
    {
        "id": 3,
        "name": "Iron Man 2",
        "link": "/assets/ironman2.svg",
        "title": "Iron Man 2 Poster",
        "yt": "https://www.youtube-nocookie.com/embed/qsRZghNciIo?si=JRrAkzWssqOQJoKt",
        "description": "Tony Stark faces pressure from the government, the press, and the  to share his Iron Man technology. As he grapples with his declining health due to the arc reactor in his chest, a new adversary, Russian scientist Ivan Vanko, emerges with his own version of the technology, seeking revenge against the Stark family.",
        "phase": 1
    }, 
    {
        "id": 4,
        "name": "Thor",
        "link": "/assets/thor.svg",
        "title": "Thor Poster",
        "yt": "https://www.youtube.com/embed/w1k59SJ_-Uo?si=42jhtZ9cCM75gc0G",
        "description": "In Thor, the powerful but arrogant god Thor is cast out of Asgard by his father Odin and sent to Earth as punishment. Stripped of his powers, he must learn humility and find a way to reclaim his worthiness, while facing threats from his homeland and discovering the true meaning of heroism.",
        "phase": 1
    }, 
    {
        "id": 5,
        "name": "Captain America",
        "link": "/assets/captainamerica.svg",
        "title": "Captain America Poster",
        "yt": "https://www.youtube.com/embed/JerVrbLldXw?si=2rkAMgJweOgbGcWU",
        "description": "Steve Rogers, a frail young man eager to serve his country during World War II, undergoes a transformation into the super-soldier Captain America. Armed with his new abilities, he faces off against the sinister organization HYDRA and its leader, the Red Skull.",
        "phase": 1
    }, 
    {
        "id": 6,
        "name": "Avengers",
        "link": "/assets/avengers.svg",
        "title": "Avengers Poster",
        "yt": "https://www.youtube.com/embed/eOrNdBpGMv8?si=1XHedeZeAUrAWLEU",
        "description": "Earth's mightiest heroes—Iron Man, Captain America, Thor, Hulk, Black Widow, and Hawkeye—must come together to stop the mischievous Loki and his alien army from enslaving humanity.",
        "phase": 1
    },
    {
        "id": 7,
        "name": "Iron Man 3",
        "link": "/assets/ironman3.svg",
        "title": "Iron Man 3 Poster",
        "yt": "https://www.youtube-nocookie.com/embed/f_h95mEd4TI?si=f5rgFYMnXyg2lYfD",
        "description": "Tony Stark faces a formidable enemy known as the Mandarin, who destroys his personal world. Stripped of his resources, Stark embarks on a quest to find those responsible, relying on his ingenuity and instincts to protect those closest to him.",
        "phase": 2
    },
    {
        "id": 8,
        "name": "Thor: The Dark World",
        "link": "/assets/thor2.svg",
        "title": "Thor: The Dark World Poster",
        "yt": "https://www.youtube-nocookie.com/embed/npvJ9FTgZbM?si=LlqeZ13aafUG6Pw6",
        "description": "Thor must embark on a perilous journey to save the universe from the ancient Dark Elves, who seek to plunge it into darkness using a powerful weapon known as the Aether. Along the way, he reunites with Jane Foster and faces personal challenges that test his strength and resolve.",
        "phase": 2
    },
    {
        "id": 9,
        "name": "Captain America: The Winter Soldier",
        "link": "/assets/captainamerica2.svg",
        "title": "Captain America: The Winter Soldier Poster",
        "yt": "https://www.youtube-nocookie.com/embed/7SlILk2WMTI?si=jPiZTsQkFV4YYgms",
        "description": "Steve Rogers, now working with S.H.I.E.L.D., faces a new threat from an enigmatic assassin known as the Winter Soldier. As he uncovers a conspiracy that threatens global security, Rogers must navigate a web of intrigue and betrayal, all while confronting a shocking revelation about his past.",
        "phase": 2
    },
    {
        "id": 10,
        "name": "Guardians of the Galaxy",
        "link": "/assets/gotg.svg",
        "title": "Guardians of the Galaxy Poster",
        "yt": "https://www.youtube-nocookie.com/embed/d96cjJhvlMA?si=wZnC7xNG2AOsl3zh",
        "description": "A group of intergalactic misfits, led by the charming rogue Peter Quill, must band together to stop a powerful villain from using a mysterious orb to wreak havoc across the universe.",
        "phase": 2
    },
    {
        "id": 11,
        "name": "Avengers: Age of Ultron",
        "link": "/assets/avengers2.svg",
        "title": "Avengers: Age of Ultron Poster",
        "yt": "https://www.youtube-nocookie.com/embed/tmeOjFno6Do?si=iYOAsnKENb9JbrER",
        "description": "Tony Stark and Bruce Banner's attempt to jumpstart a dormant peacekeeping program goes awry, leading to the creation of Ultron, a powerful AI with a destructive agenda. The Avengers must reassemble to stop Ultron from enacting his catastrophic plans and save humanity.",
        "phase": 2
    },
    {
        "id": 12,
        "name": "Ant-Man",
        "link": "/assets/antman.svg",
        "title": "Ant-Man Poster",
        "yt": "https://www.youtube-nocookie.com/embed/pWdKf3MneyI?si=ziCIIcyG28Mw7OTr",
        "description": "Scott Lang is recruited by scientist Hank Pym to don a suit that allows him to shrink in size while increasing in strength. Together, they must pull off a heist to protect the secret of the Ant-Man technology from falling into the wrong hands.",
        "phase": 2
    },
    {
        "id": 13,
        "name": "Captain America: Civil War",
        "link": "/assets/captainamerica3.svg",
        "title": "Captain America Civil War Poster",
        "yt": "https://www.youtube-nocookie.com/embed/dKrVegVI0Us?si=f-zZLOSFX_6MzKEg",
        "description": "Political pressure to regulate the Avengers' activities leads to a rift between Captain America and Iron Man. As tensions rise, the team is divided, forcing the heroes to choose sides and confront each other while a new threat looms in the background.",
        "phase": 3
    },
    {
        "id": 14,
        "name": "Doctor Strange",
        "link": "/assets/doctorstrange.svg",
        "title": "Doctor Strange Poster",
        "yt": "https://www.youtube-nocookie.com/embed/HSzx-zryEgM?si=JH11lymFwVSY0ul8",
        "description": "A brilliant but arrogant neurosurgeon, Dr. Stephen Strange, suffers a career-ending injury and embarks on a journey of healing. Along the way, he discovers the hidden world of mysticism and alternate dimensions, transforming into a powerful sorcerer to protect the world from dark forces.",
        "phase": 3
    },
    {
        "id": 15,
        "name": "Guardians of the Galaxy Vol.2",
        "link": "/assets/gotg2.svg",
        "title": "Guardians of the Galaxy Vol.2 Poster",
        "yt": "https://www.youtube-nocookie.com/embed/wUn05hdkhjM?si=ACnQ8mB2WkkNKOFX",
        "description": "The Guardians struggle to stay united as they unravel the mystery of Peter Quill's true parentage. Along the way, they face new enemies and form unexpected alliances, all while dealing with personal family issues and the threat of a powerful new adversary.",
        "phase": 3
    },
    {
        "id": 16,
        "name": "Spider-Man: Homecoming",
        "link": "/assets/spiderman.svg",
        "title": "Spider-Man: Homecoming Poster",
        "yt": "https://www.youtube-nocookie.com/embed/U0D3AOldjMU?si=4ZQH5a-RGsrgLfew",
        "description": "A young Peter Parker navigates his dual life as a high school student and the web-slinging superhero Spider-Man. Under the mentorship of Tony Stark, he faces the challenge of proving himself while confronting the villainous Vulture, who threatens his city.",
        "phase": 3
    },
    {
        "id": 17,
        "name": "Thor: Ragnarok",
        "link": "/assets/thor3.svg",
        "title": "Thor: Ragnarok Poster",
        "yt": "https://www.youtube-nocookie.com/embed/ue80QwXMRHg?si=GwEx8YOtBbimMt3E",
        "description": "Thor finds himself imprisoned on the other side of the universe without his mighty hammer. He must race against time to return to Asgard and stop the powerful Hela from bringing about Ragnarok, the destruction of his home world and the end of Asgardian civilization.",
        "phase": 3
    },
    {
        "id": 18,
        "name": "Black Panther",
        "link": "/assets/blackpanther.svg",
        "title": "Black Panther Poster",
        "yt": "https://www.youtube-nocookie.com/embed/xjDjIWPwcPU?si=lieaDLbhlKiLGUty",
        "description": "T'Challa returns to his homeland of Wakanda to take his place as king. However, he soon faces a powerful adversary who challenges his leadership and threatens the future of Wakanda. T'Challa must harness the power of the Black Panther to protect his people and their way of life.",
        "phase": 3
    },
    {
        "id": 19,
        "name": "Avengers: Infinity War",
        "link": "/assets/avengers3.svg",
        "title": "Avengers: Infinity War Poster",
        "yt": "https://www.youtube-nocookie.com/embed/6ZfuNTqbHE8?si=E0kUPGvHCYCb6nsi",
        "description": "The Avengers and their allies must unite to stop the powerful Thanos from collecting all six Infinity Stones, which he plans to use to impose his twisted will on the universe. The fate of Earth and existence itself hangs in the balance as they face their most formidable enemy yet.",
        "phase": 3
    },
    {
        "id": 20,
        "name": "Ant-Man and the Wasp",
        "link": "/assets/antman2.svg",
        "title": "Ant-Man and the Wasp Poster",
        "yt": "https://www.youtube-nocookie.com/embed/UUkn-enk2RU?si=eKvyeh6YVcR02Lbf",
        "description": "Scott Lang struggles to balance his responsibilities as a superhero and a father. When Hope van Dyne and Dr. Hank Pym present him with an urgent new mission, he must once again don the Ant-Man suit and team up with the Wasp to uncover secrets from their past and face a formidable new enemy.",
        "phase": 3
    },
    {
        "id": 21,
        "name": "Captain Marvel",
        "link": "/assets/captainmarvel.svg",
        "title": "Captain Marvel Poster",
        "yt": "https://www.youtube-nocookie.com/embed/Z1BCujX3pw8?si=9QEurKt_1LvffI0-",
        "description": "Carol Danvers becomes one of the universe's most powerful heroes when Earth is caught in the middle of a galactic war between two alien races. As she uncovers her past and embraces her destiny, she must harness her newfound powers to protect the planet.",
        "phase": 3
    },
    {
        "id": 22,
        "name": "Avengers: Endgame",
        "link": "/assets/avengers4.svg",
        "title": "Avengers: Endgame Poster",
        "yt": "https://www.youtube-nocookie.com/embed/TcMBFSGVi1c?si=fb1oIUpQOzJlk2Nn",
        "description": "the surviving Avengers and their allies must come together to undo the catastrophic events caused by Thanos. With the universe in ruins, they embark on a final mission to restore balance and bring back those who were lost.",
        "phase": 3
    },
    {
    "id": 23,
    "name": "Spider-Man: Far From Home",
    "link": "/assets/spiderman2.svg",
    "title": "Spider-Man: Far From Home Poster",
    "yt": "https://www.youtube-nocookie.com/embed/Nt9L1jCKGnE?si=v-aTVmi9I7drihpq",
    "description": "Peter Parker goes on a school trip to Europe, hoping to leave his superhero duties behind. However, his plans are disrupted when Nick Fury recruits him to battle mysterious elemental creatures alongside a new ally, Mysterio.",
    "phase": 3
    }
]